In [1]:
import numpy as np
import pandas as pd
from sqlalchemy import create_engine
from config import db_password
from io import StringIO # python3; python2: BytesIO 
import boto3
import s3fs
import awscli
import timeit
import os
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

In [ ]:
db_string = f"postgres://postgres:{db_password}@127.0.0.1:5432/team3"

In [4]:
path = 'Resources/'
objects = pd.read_csv(path +'objects_clean.csv', index_col=0)
objects.head()

C:\Users\phsstudent\anaconda3\envs\mlenv\lib\site-packages\IPython\core\interactiveshell.py:3072: DtypeWarning: Columns (3,5,7,8,9,10,11,13,14,17,18) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

  object_id entity_type parent_id                name    category_code     status  founded_at closed_at country_code state_code         city       region first_investment_at last_investment_at  investment_rounds  invested_companies first_funding_at last_funding_at  funding_rounds  funding_total_usd first_milestone_at last_milestone_at  milestones  relationships
0       c:1     Company       NaN            Wetpaint              web  operating  2005-10-17       NaN          USA         WA      Seattle      Seattle                 NaN                NaN                  0                   0       2005-10-01      2008-05-19               3         39750000.0         2010-09-05        2013-09-18           5             17
1      c:10     Company       NaN             Flektor      games_video   acquired         NaN       NaN          USA         CA  Culver City  Los Angeles                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              6
2     c:100     Company       NaN               There      games_video   acquired         NaN       NaN          USA         CA    San Mateo       SF Bay                 NaN                NaN                  0                   0              NaN             NaN               0                0.0         2003-02-01        2011-09-23           4             12
3   c:10000     Company       NaN             MYWEBBO  network_hosting  operating  2008-07-26       NaN          NaN        NaN          NaN      unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              0
4   c:10001     Company       NaN  THE Movie Streamer      games_video  operating  2008-07-26       NaN          NaN        NaN          NaN      unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              0

In [7]:
geocode_test = objects[['object_id', 'city', 'state_code', 'country_code']]
geocode_test.head()

  object_id         city state_code country_code
0       c:1      Seattle         WA          USA
1      c:10  Culver City         CA          USA
2     c:100    San Mateo         CA          USA
3   c:10000          NaN        NaN          NaN
4   c:10001          NaN        NaN          NaN

In [8]:
office = pd.read_csv(path +'offices_clean.csv', index_col=0)
office.head()

  object_id   region            address1         address2           city zip_code state_code country_code   latitude   longitude
0       c:1  Seattle    710 - 2nd Avenue       Suite 1100        Seattle    98104         WA          USA  47.603122 -122.333253
1       c:3   SF Bay     4900 Hopyard Rd        Suite 310     Pleasanton    94588         CA          USA  37.692934 -121.904945
2       c:4   SF Bay  135 Mississippi St              NaN  San Francisco    94107         CA          USA  37.764726 -122.394523
3       c:5   SF Bay    1601 Willow Road              NaN     Menlo Park    94025         CA          USA  37.416050 -122.151801
4       c:7   SF Bay           Suite 200  654 High Street      Palo Alto    94301         CA          ISR   0.000000    0.000000